---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTableIterator.Dispose
source: html/b55826ff-4560-39ec-b9f5-1718c571c22d.htm
---
# Autodesk.Revit.DB.ExportFontTableIterator.Dispose Method

Releases all resources used by the ExportFontTableIterator

## Syntax (C#)
```csharp
public void Dispose()
```